{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Lambda", "config": {"batch_input_shape": [null, 66, 200, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\nmodel_3.py\u00da\b<lambda>\u00fa\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "input_dtype": "float32", "arguments": {}, "name": "Normalize", "output_shape": null, "trainable": true, "output_shape_type": "raw", "function_type": "lambda"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_filter": 24, "bias": true, "border_mode": "valid", "nb_row": 5, "name": "Conv1", "nb_col": 5, "b_constraint": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_filter": 36, "bias": true, "border_mode": "valid", "nb_row": 5, "name": "Conv2", "nb_col": 5, "b_constraint": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "Dropout1"}}, {"class_name": "Convolution2D", "config": {"subsample": [2, 2], "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_filter": 48, "bias": true, "border_mode": "valid", "nb_row": 5, "name": "Conv3", "nb_col": 5, "b_constraint": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "Dropout2"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_filter": 64, "bias": true, "border_mode": "valid", "nb_row": 3, "name": "Conv4", "nb_col": 3, "b_constraint": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Convolution2D", "config": {"subsample": [1, 1], "init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "nb_filter": 64, "bias": true, "border_mode": "valid", "nb_row": 3, "name": "Conv5", "nb_col": 3, "b_constraint": null, "trainable": true, "activity_regularizer": null, "dim_ordering": "tf"}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "Dropout3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "output_dim": 100, "name": "FC1", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 1152}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.2, "name": "Dropout4"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "output_dim": 50, "name": "FC2", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 100}}, {"class_name": "Dropout", "config": {"trainable": true, "p": 0.5, "name": "Dropout5"}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "relu", "W_regularizer": null, "output_dim": 10, "name": "FC3", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 50}}, {"class_name": "Dense", "config": {"init": "glorot_uniform", "W_constraint": null, "b_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "output_dim": 1, "name": "Output", "b_constraint": null, "trainable": true, "activity_regularizer": null, "input_dim": 10}}]}