{"config": [{"config": {"name": "Normalize", "batch_input_shape": [null, 160, 320, 3], "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e9\u00ff\u0000\u0000\u0000\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\bmodel.py\u00da\b<lambda>\u00af\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "output_shape": null, "arguments": {}, "input_dtype": "float32"}, "class_name": "Lambda"}, {"config": {"name": "Cropping", "cropping": [[55, 25], [0, 0]], "trainable": true}, "class_name": "Cropping2D"}, {"config": {"name": "Resize", "function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0004\u0000\u0000\u0000S\u0000\u0000\u0000s%\u0000\u0000\u0000d\u0001\u0000d\u0000\u0000l\u0000\u0000}\u0001\u0000|\u0001\u0000j\u0001\u0000j\u0002\u0000|\u0000\u0000d\u0004\u0000\u0083\u0002\u0000}\u0000\u0000|\u0000\u0000S)\u0005N\u00e9\u0000\u0000\u0000\u0000\u00e9B\u0000\u0000\u0000\u00e9\u00c8\u0000\u0000\u0000)\u0002r\u0002\u0000\u0000\u0000r\u0003\u0000\u0000\u0000)\u0003\u00da\ntensorflow\u00da\u0005image\u00da\rresize_images)\u0002\u00da\u0003img\u00da\u0002tf\u00a9\u0000r\t\u0000\u0000\u0000\u00fa\bmodel.py\u00da\u0006resize\u00a8\u0000\u0000\u0000s\u0006\u0000\u0000\u0000\u0000\u0001\f\u0001\u0015\u0001", null, null], "function_type": "lambda", "output_shape_type": "raw", "trainable": true, "output_shape": null, "arguments": {}}, "class_name": "Lambda"}, {"config": {"name": "Conv1", "nb_filter": 24, "W_constraint": null, "trainable": true, "nb_row": 5, "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "W_regularizer": null, "activation": "relu", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "Conv2", "nb_filter": 36, "W_constraint": null, "trainable": true, "nb_row": 5, "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "W_regularizer": null, "activation": "relu", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "Dropout1", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Conv3", "nb_filter": 48, "W_constraint": null, "trainable": true, "nb_row": 5, "activity_regularizer": null, "b_constraint": null, "nb_col": 5, "W_regularizer": null, "activation": "relu", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [2, 2], "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "Dropout2", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "Conv4", "nb_filter": 64, "W_constraint": null, "trainable": true, "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "Conv5", "nb_filter": 64, "W_constraint": null, "trainable": true, "nb_row": 3, "activity_regularizer": null, "b_constraint": null, "nb_col": 3, "W_regularizer": null, "activation": "relu", "bias": true, "dim_ordering": "tf", "init": "glorot_uniform", "subsample": [1, 1], "b_regularizer": null, "border_mode": "valid"}, "class_name": "Convolution2D"}, {"config": {"name": "Dropout3", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "flatten_1", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "FC1", "input_dim": 1152, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 100, "W_regularizer": null, "activation": "relu", "bias": true, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "Dropout4", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "FC2", "input_dim": 100, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 50, "W_regularizer": null, "activation": "relu", "bias": true, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "Dropout5", "p": 0.2, "trainable": true}, "class_name": "Dropout"}, {"config": {"name": "FC3", "input_dim": 50, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 10, "W_regularizer": null, "activation": "relu", "bias": true, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}, {"config": {"name": "Output", "input_dim": 10, "W_constraint": null, "trainable": true, "b_constraint": null, "activity_regularizer": null, "output_dim": 1, "W_regularizer": null, "activation": "linear", "bias": true, "init": "glorot_uniform", "b_regularizer": null}, "class_name": "Dense"}], "keras_version": "1.2.0", "class_name": "Sequential"}